000_РОЗНИЦА_ЦЕНТР/src/Catalogs/НастройкиСлужбДоставки/НастройкиСлужбДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиСлужбДоставки</name>
  <attributes>
    <name>СлужбаДоставки</name>
    <type>
      <types>EnumRef.ОператорыДоставки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтоимостьДоставки</name>
    <attributes>
      <name>ТипДоставки</name>
      <type>
        <types>EnumRef.ТипыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальнаяСуммаПосылки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/НастройкиСлужбДоставки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СтоимостьДоставки(ДатаДокумента, СлужбаДоставки, ТипДоставки) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("СуммаБесплатнойДоставки", 0);
	Результат.Вставить("СуммаДоставкиСлужбойДоставки", 0);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	НастройкиСлужбДоставкиСтоимостьДоставки.СуммаДоставки КАК СуммаДоставкиСлужбойДоставки,
		|	НастройкиСлужбДоставкиСтоимостьДоставки.МаксимальнаяСуммаПосылки КАК СуммаБесплатнойДоставки
		|ИЗ
		|	Справочник.НастройкиСлужбДоставки.СтоимостьДоставки КАК НастройкиСлужбДоставкиСтоимостьДоставки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиСлужбДоставки КАК НастройкиСлужбДоставки
		|		ПО НастройкиСлужбДоставкиСтоимостьДоставки.Ссылка = НастройкиСлужбДоставки.Ссылка
		|ГДЕ
		|	НастройкиСлужбДоставки.СлужбаДоставки = &СлужбаДоставки
		|	И НастройкиСлужбДоставкиСтоимостьДоставки.ТипДоставки В (&ТипДоставки)";
	
	Запрос.УстановитьПараметр("ТипДоставки", Перечисления.ТипыДоставки.ПолусчитьТипыДоставки(ТипДоставки));
	Запрос.УстановитьПараметр("СлужбаДоставки", СлужбаДоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
	Иначе
		
		УчетнаяПолитика = ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику(ДатаДокумента);
		Результат.СуммаДоставкиСлужбойДоставки = УчетнаяПолитика.СуммаДоставкиЗаказаПокупателя;
		Результат.СуммаБесплатнойДоставки = УчетнаяПолитика.СуммаБесплатнойДоставки;
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
